In [1]:
import pandas as pd
people = {
    "first" : ["Gildong", "Chunhyang", "Mongryoung"],
    "last" : ["Hong", "Sung", "Lee"],
    "email" : ["gdhong@gmail.com", "chsung@gmail.com", "mrlee@gmail.com"]
}
df = pd.DataFrame(people)

In [2]:
df

        first  last             email
0     Gildong  Hong  gdhong@gmail.com
1   Chunhyang  Sung  chsung@gmail.com
2  Mongryoung   Lee   mrlee@gmail.com

In [3]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [4]:
df.columns = ['first_name', 'last_name', 'email']

In [5]:
df

   first_name last_name             email
0     Gildong      Hong  gdhong@gmail.com
1   Chunhyang      Sung  chsung@gmail.com
2  Mongryoung       Lee   mrlee@gmail.com

In [6]:
col_arr = [x for x in df.columns]

In [7]:
col_arr

['first_name', 'last_name', 'email']

In [8]:
arr = [x for x in range(1, 10, 2)]
arr

[1, 3, 5, 7, 9]

In [9]:
col_arr = [x.upper() for x in df.columns]
col_arr

['FIRST_NAME', 'LAST_NAME', 'EMAIL']

In [10]:
df.columns = col_arr
df

   FIRST_NAME LAST_NAME             EMAIL
0     Gildong      Hong  gdhong@gmail.com
1   Chunhyang      Sung  chsung@gmail.com
2  Mongryoung       Lee   mrlee@gmail.com

In [11]:
[x.replace('_', ' ') for x in df.columns]

['FIRST NAME', 'LAST NAME', 'EMAIL']

In [12]:
df

   FIRST_NAME LAST_NAME             EMAIL
0     Gildong      Hong  gdhong@gmail.com
1   Chunhyang      Sung  chsung@gmail.com
2  Mongryoung       Lee   mrlee@gmail.com

In [13]:
df.columns = [x.replace('_', ' ') for x in df.columns]
df

   FIRST NAME LAST NAME             EMAIL
0     Gildong      Hong  gdhong@gmail.com
1   Chunhyang      Sung  chsung@gmail.com
2  Mongryoung       Lee   mrlee@gmail.com

In [14]:
arr = ['my_apple', 'your_grape', 'his_money']

In [15]:
df.columns

Index(['FIRST NAME', 'LAST NAME', 'EMAIL'], dtype='object')

In [16]:
type(df.columns)

pandas.core.indexes.base.Index

In [17]:
df.columns.str.replace(' ', '_')

Index(['FIRST_NAME', 'LAST_NAME', 'EMAIL'], dtype='object')

In [18]:
df

   FIRST NAME LAST NAME             EMAIL
0     Gildong      Hong  gdhong@gmail.com
1   Chunhyang      Sung  chsung@gmail.com
2  Mongryoung       Lee   mrlee@gmail.com

In [19]:
df.columns = df.columns.str.replace(' ', '_')

In [20]:
df

   FIRST_NAME LAST_NAME             EMAIL
0     Gildong      Hong  gdhong@gmail.com
1   Chunhyang      Sung  chsung@gmail.com
2  Mongryoung       Lee   mrlee@gmail.com

In [21]:
df.rename(columns = {'FIRST_NAME' : 'first', 'LAST_NAME' : 'last'})

        first  last             EMAIL
0     Gildong  Hong  gdhong@gmail.com
1   Chunhyang  Sung  chsung@gmail.com
2  Mongryoung   Lee   mrlee@gmail.com

원본은 그대로 있음

In [22]:
df

   FIRST_NAME LAST_NAME             EMAIL
0     Gildong      Hong  gdhong@gmail.com
1   Chunhyang      Sung  chsung@gmail.com
2  Mongryoung       Lee   mrlee@gmail.com

원본 df 바꾸기 inplace

In [23]:
df.rename(columns = {'FIRST_NAME' : 'first', 'LAST_NAME' : 'last'}, inplace = True)

In [24]:
df

        first  last             EMAIL
0     Gildong  Hong  gdhong@gmail.com
1   Chunhyang  Sung  chsung@gmail.com
2  Mongryoung   Lee   mrlee@gmail.com

In [25]:
df.loc[2]

first         Mongryoung
last                 Lee
EMAIL    mrlee@gmail.com
Name: 2, dtype: object

In [26]:
df.loc[2, 'first']

'Mongryoung'

In [27]:
df.loc[2] = ['몽룡', '이', 'mrlee@yju.ac.kr']
df

       first  last             EMAIL
0    Gildong  Hong  gdhong@gmail.com
1  Chunhyang  Sung  chsung@gmail.com
2         몽룡     이   mrlee@yju.ac.kr

In [28]:
df.loc[2, ['last', 'EMAIL']]

last                   이
EMAIL    mrlee@yju.ac.kr
Name: 2, dtype: object

In [29]:
df.loc[2, ['last', 'EMAIL']] = ['Lee', 'mrlee@gmail.com']
df

       first  last             EMAIL
0    Gildong  Hong  gdhong@gmail.com
1  Chunhyang  Sung  chsung@gmail.com
2         몽룡   Lee   mrlee@gmail.com

In [55]:
df.rename(columns = {'email' : 'Email'}, inplace=True)

In [56]:
df

       first  last             EMAIL
0    Gildong  Hong  gdhong@gmail.com
1  Chunhyang  Sung  chsung@gmail.com
2         몽룡  Park  mrpark@gmail.com

In [31]:
df['EMAIL'] == 'mrlee@gmail.com'

0    False
1    False
2     True
Name: EMAIL, dtype: bool

In [32]:
df[df['EMAIL'] == 'mrlee@gmail.com']

  first last            EMAIL
2    몽룡  Lee  mrlee@gmail.com

In [33]:
filt = df['EMAIL'] == 'mrlee@gmail.com'

In [34]:
df[filt]

  first last            EMAIL
2    몽룡  Lee  mrlee@gmail.com

first 칼럼의 값이 '몽룡'인 행을 찾아서, 그 행의 last, email 칼럼 값을 각각
'Part', 'mrpark@gmail.com' 으로 변경하시오.

In [43]:
df.loc[2, 'first'] = '몽룡'

In [44]:
df

       first  last             EMAIL
0    Gildong  Hong  gdhong@gmail.com
1  Chunhyang  Sung  chsung@gmail.com
2         몽룡  Park  mrpark@gmail.com

In [45]:
filt = df['first'] == '몽룡'

In [46]:
df.loc[filt, ['last', 'EMAIL']] = ['Park', 'mrpark@gmail.com']

In [47]:
df

       first  last             EMAIL
0    Gildong  Hong  gdhong@gmail.com
1  Chunhyang  Sung  chsung@gmail.com
2         몽룡  Park  mrpark@gmail.com

In [50]:
df.loc[filt, ['last', 'EMAIL']]

   last             EMAIL
2  Park  mrpark@gmail.com